src/Catalogs/ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныСообщений</Name>
			<Comment>Шаблоны сообщений</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеМессенджерHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеМессенджер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеPush</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецШаблона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецШаблонаСообщения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВТранслите</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяТипаПараметраВводаНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляВводаНаОсновании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляЭлектронныхПисем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаSMS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПисьмаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекстаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранслитерироватьИменаФайлов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковатьВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВложений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПоВнешнейОбработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаВидВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПериодВыполнения</Name>
					<Comment>Значение, указываемое в днях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMSВремяНачалаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMSВремяОкончанияОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормыИВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШаблоныСообщений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем Документ;

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьПолеВвода();
	
	ОтображниеКода = ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");
	Если ОтображниеКода Тогда
		Элементы.Код.Видимость = Истина;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Авто;
	Иначе 
		Элементы.Код.Видимость = Ложь;
		Элементы.Код.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
	Дерево = РеквизитФормыВЗначение("ОбъектДеревоРеквизитов");
	
	ТаблицаПараметров = ОбщегоНазначенияПовтИсп.ПолучитьТаблицуПараметровВсехПодставляемыхРеквизитов();
	ТаблицаРодителейПараметров = ТаблицаПараметров.Скопировать(, "ПредставлениеОсновнойТаблицаОбъекта");
	ТаблицаРодителейПараметров.Свернуть("ПредставлениеОсновнойТаблицаОбъекта");
	
	Для Каждого СтрокаРодитель Из ТаблицаРодителейПараметров Цикл 
		РодительСтрок = ДобавитьСтрокуВДеревоЗначений(Дерево, СтрокаРодитель.ПредставлениеОсновнойТаблицаОбъекта, СтрокаРодитель.ПредставлениеОсновнойТаблицаОбъекта, Ложь, , БиблиотекаКартинок.ИконкаПапкиДляСписка);
		МассивПараметров = ТаблицаПараметров.НайтиСтроки(Новый Структура("ПредставлениеОсновнойТаблицаОбъекта", СтрокаРодитель.ПредставлениеОсновнойТаблицаОбъекта));
		Для Каждого ЭлементМассива Из МассивПараметров Цикл 
			ДобавитьСтрокуВДеревоЗначений(РодительСтрок, ЭлементМассива.НаименованиеПараметра, ЭлементМассива.ПредставлениеПараметра, , , БиблиотекаКартинок.ИконкаЭлементДляСписка);
		КонецЦикла;	
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ОбъектДеревоРеквизитов");	
	ЭтотОбъект.СодержаниеФД.Добавить(Объект.Содержание);
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаСервере
// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)	
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	УстановитьТекстШаблона(ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриОткрытии(Отказ)
	
	СформироватьПолеВвода();	
	Элементы.СодержаниеМессенджерHTML.Документ.defaultView.templateValue = Объект.СодержаниеМессенджерHTML;
	
	КоллекцияЭлементовДерева = ОбъектДеревоРеквизитов.ПолучитьЭлементы();	
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		Если Строка.НаименованиеПараметра = АктуальныйРаздел Тогда 
			ИдентификаторСтроки = Строка.ПолучитьИдентификатор();
			Элементы.ДеревоРеквизитов.Развернуть(ИдентификаторСтроки);
		КонецЕсли;	
	КонецЦикла;
	АктуальныйРаздел = "";
	
	ПроцедураОбработкиНажатияМеню("ШаблонМессенджера", Истина);
	ЗадачаПериодВыполненияПриИзменении(ЭтаФорма.Элементы.Найти("ЗадачаПериодВыполнения"));	
	// АктивацияПунктаМеню ();
	
	// Заголовок= "Введите текст!";
	Список = Элементы.КомандаformatBlock.СписокВыбора;
	Список.Добавить("<p>", "Обычный");
	Список.Добавить("<h1>", "Заголовок 1");
	Список.Добавить("<h2>", "Заголовок 2");
	Список.Добавить("<h3>", "Заголовок 3");
	Список.Добавить("<h4>", "Заголовок 4");
	Список.Добавить("<h5>", "Заголовок 5");
	Список.Добавить("<h6>", "Заголовок 6");
	Список.Добавить("<pre>", "Форматированный");
	Список.Добавить("<address>", "Адрес");
	ТекЭлемент = Список.НайтиПоИдентификатору(0);
	СтилиТекста = ТекЭлемент.Значение;

	// Заполнение списка шрифтов
	Список = Элементы.КомандаFontName.СписокВыбора;
	Список.Добавить("Arial");
	Список.Добавить("Arial Black");
	Список.Добавить("Arial Narrow");
	Список.Добавить("Comic Sans MS");
	Список.Добавить("Courier New");
	Список.Добавить("System");
	Список.Добавить("Tahoma");
	Список.Добавить("Times New Roman");
	Список.Добавить("Verdana");
	Список.Добавить("Wingdings");
	ТекЭлемент = Список.НайтиПоИдентификатору(0);
    ИмяШрифта = ТекЭлемент.Значение;
	
	// Заполнение списка размеров
	Список = Элементы.КомандаFontSize.СписокВыбора;
	Для Ном = 1 По 14 Цикл
		Список.Добавить(Ном);
	КонецЦикла;
	ТекЭлемент = Список.НайтиПоИдентификатору(2);
	РазмерыШрифта = ТекЭлемент.Значение;	
	
	ОбновитьСтатусВведеныхСимволов();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перед записью
//
// Параметры:
//  Отказ			 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ Элементы.СодержаниеМессенджерHTML.Документ = Неопределено Тогда 
		Объект.СодержаниеМессенджер = СохранитьСодержаниеМессенджер();
	КонецЕсли;	
	
	ПисьмоТекстHTML.ПолучитьHTML(Объект.ТекстHTML, Новый Структура);
	
КонецПроцедуры

&НаСервере
// Процедура - Перед записью на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТаблицаСоответствийИменВложенийИдентификаторам = Новый СписокЗначений;
	СтруктураВложений = Новый Структура;
	ПисьмоТекстHTML.ПолучитьHTML(ТекущийОбъект.ТекстHTML, СтруктураВложений);
	Для каждого Вложение Из СтруктураВложений Цикл
		ТаблицаСоответствийИменВложенийИдентификаторам.Добавить(Вложение.Ключ, Новый УникальныйИдентификатор,, Вложение.Значение);
	КонецЦикла;
	
	ПараметрыЗаписи.Вставить("ВложенияHTML", ТаблицаСоответствийИменВложенийИдентификаторам);
	
	Если ТаблицаСоответствийИменВложенийИдентификаторам.Количество() > 0 Тогда
			
		ДокументHTML = Гипертекст.ПолучитьОбъектДокументHTMLИзТекстаHTML(ТекущийОбъект.ТекстHTML);
		ЗаменитьИменаКартинокНаИдентификаторыПочтовыхВложенийВHTML( ДокументHTML, ТаблицаСоответствийИменВложенийИдентификаторам);
		ТекущийОбъект.ТекстHTML = Гипертекст.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - При записи на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
		СписокФайлов = Новый Массив;
		МодульРаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ТекущийОбъект.Ссылка, СписокФайлов);
		Для каждого Вложение Из СписокФайлов Цикл
			Если ЗначениеЗаполнено(Вложение.Наименование) Тогда
				УдалитьПрисоединенныйФайл(Вложение.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СохранитьКартинкиФорматированногоДокументаКакПрисоединенныеФайлы(ТекущийОбъект.Ссылка, 
		 ПараметрыЗаписи.ВложенияHTML, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.СодержаниеМессенджерHTML) Тогда
		Оповестить("ЗаписанШаблонСообщенияМессенджера", Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПереключательОтображенияПоляHTMLПриИзменении(Элемент)
	
	Если ЭтотОбъект.ПереключательОтображенияПоляHTML = 0 Тогда
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ТекстHTMLКод) Тогда 
			
			ЭтотОбъект.ПисьмоТекстHTML = ЭтотОбъект.ТекстHTMLКод;
			ВключитьРежимРедактированияHTMLКлиент();
		КонецЕсли;
		
		ЭтаФорма.Элементы.ГруппаПросмотр.Видимость = Истина;	
		ЭтаФорма.Элементы.ГруппаКод.Видимость         = Ложь;	
		
	Иначе
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ПисьмоТекстHTML) Тогда  
			ЭтотОбъект.ТекстHTMLКод = ЭтотОбъект.ПисьмоТекстHTML;
		КонецЕсли;
		
		ЭтаФорма.Элементы.ГруппаПросмотр.Видимость = Ложь;	
		ЭтаФорма.Элементы.ГруппаКод.Видимость         = Истина;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Задача период выполнения при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ЗадачаПериодВыполненияПриИзменении(Элемент)
	
	Элементы.ДекорацияДень.Заголовок = СтроковыеФункцииКлиентСервер.ВернутьСловоСклоненноеПоЧислу("День", Объект.ЗадачаПериодВыполнения);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура СодержаниеPushФДПриИзменении(Элемент)
	
	Объект.СодержаниеPush = ЭтотОбъект.СодержаниеPushФД.ПолучитьТекст();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "При изменении".
//
Процедура СодержаниеФДПриИзменении(Элемент)
	
	Объект.Содержание = ЭтотОбъект.СодержаниеФД.ПолучитьТекст();
	ПодключитьОбработчикОжидания("ОбновитьСтатусВведеныхСимволов", 0.2, Истина);
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Содержание окончание ввода текста.
//
// Параметры:
//  Элемент					 - 	 - 
//  Текст					 - 	 - 
//  ДанныеВыбора			 - 	 - 
//  ПараметрыПолученияДанных - 	 - 
//  СтандартнаяОбработка	 - 	 - 
//
Процедура СодержаниеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПодключитьОбработчикОжидания("ОбновитьСтатусВведеныхСимволов", 0.2, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Выполнить команду
//
// Параметры:
//  Кнопка	 - 	 - 
//
Процедура ВыполнитьКоманду(Кнопка)
	
	Команда = Сред(Кнопка.Имя, 8);
	Если Документ.queryCommandSupported(Команда) Тогда
		Документ.execCommand(Команда, Ложь);
		ПоказатьРежимыКнопок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выполнить команду списка
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ВыполнитьКомандуСписка(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Команда = Сред(Элемент.Имя, 8);
	Если Документ.queryCommandSupported(Команда) Тогда
		Список = Элемент.СписокВыбора;
		Документ.execCommand(Команда, Истина, ВыбранноеЗначение);
		ПоказатьРежимыКнопок();
	КонецЕсли;
	ЭтаФорма.ТекущийЭлемент = Элементы.ПолеHTMLДокумента;
	
КонецПроцедуры

&НаКлиенте  
// Процедура выбора цвета.
//
Процедура ВыборЦвета(Команда)
	
	ОткрытьФорму("Обработка.ВыборWebЦвета.Форма",,,,,,
	Новый ОписаниеОповещения("ВыборЦветаЗавершение", ЭтотОбъект, Команда), 
	РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После выбора Цвета
//
// Параметры:
//  РезультатВыбора			 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ВыборЦветаЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		Кнопка = Сред(ДополнительныеПараметры.Имя, 8);
		Если Документ.queryCommandSupported(Кнопка) Тогда
			Документ.execCommand(Кнопка, Ложь, "" + ПеревестиИз10(РезультатВыбора.Красный) + ПеревестиИз10(РезультатВыбора.Зеленый) + ПеревестиИз10(РезультатВыбора.Синий));
		КонецЕсли;
		Модифицированность = Истина;
	КонецЕсли; 	

	ПоказатьРежимыКнопок();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура Добавить(Команда)
	
	ТекущиеДанные = Элементы.ДеревоРеквизитов.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.РазрешитьВыбор = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементРодитель = ТекущиеДанные.ПолучитьРодителя();
	Если ЭлементРодитель <>Неопределено Тогда 
		АктуальныйРаздел = ЭлементРодитель.НаименованиеПараметра
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ФорматСтроки) Тогда 
    	Представление = ТекущиеДанные.ФорматСтроки; 
    Иначе	
	    Представление = ТекущиеДанные.НаименованиеПараметра;
    КонецЕсли;
	
	ДобавитьЗавершение(Представление);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить завершение
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ДобавитьЗавершение(Результат, Параметры = Неопределено)
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = "{" + Результат + "}";
	Результат = СтрЗаменить(Результат, "{{", "{");
	Результат = СтрЗаменить(Результат, "}}", "}");
	
	Если Элементы.ГруппаМессенджер.Видимость = Истина Тогда
		Документ = Элементы.СодержаниеМессенджерHTML.Документ;
		
		ТекстовыйБлок = Документ.getElementsByClassName("emojionearea-editor");
		
		Если НЕ ТекстовыйБлок = Неопределено ИЛИ ТекстовыйБлок.length > 0 Тогда
			
			ПолеВвода			 = ТекстовыйБлок[0];
			ПолеВвода.innerHTML	 = ПолеВвода.innerHTML + Результат;
			
			ПолеВвода.focus();
			ПолеВвода.scroll(0, ПолеВвода.scrollHeight);
			
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаPush.Видимость = Истина Тогда
		ВставитьПараметр(Результат, ЭтотОбъект.СодержаниеPushФД, Элементы.СодержаниеPushФД);
		Объект.СодержаниеPush = ЭтотОбъект.СодержаниеPushФД.ПолучитьТекст();
		
	ИначеЕсли Элементы.ГруппаSMS.Видимость = Истина Тогда
		ВставитьПараметр(Результат, ЭтотОбъект.СодержаниеФД, Элементы.СодержаниеФД);
		Объект.Содержание = ЭтотОбъект.СодержаниеФД.ПолучитьТекст();
		
		ОбновитьСтатусВведеныхСимволов();
    ИначеЕсли Элементы.ГруппаПисьмо.Видимость = Истина Тогда
		ВставитьПараметр(Результат, ЭтотОбъект.ПисьмоТекстHTML, Элементы.ПолеHTMLДокумента, Истина);
	Иначе
		Элементы.ЗадачаОписание.ВыделенныйТекст = ?(ЗначениеЗаполнено(Объект.ЗадачаОписание), " ", "") + Результат + ?(ЗначениеЗаполнено(Объект.ЗадачаОписание), " ", "");
		// Объект.ЗадачаОписание = Объект.ЗадачаОписание + ?(ЗначениеЗаполнено(Объект.ЗадачаОписание), " ", "") + Результат + ?(ЗначениеЗаполнено(Объект.ЗадачаОписание), " ", "");	
	КонецЕсли;
	   
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Шаблон мессенджера
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ШаблонМессенджера(Команда)
	
	ПроцедураОбработкиНажатияМеню("ШаблонМессенджера");
	
	СформироватьПолеВвода();	
	Если НЕ Элементы.СодержаниеМессенджерHTML.Документ = Неопределено Тогда 	
		Элементы.СодержаниеМессенджерHTML.Документ.defaultView.templateValue = Объект.СодержаниеМессенджерHTML;
	КонецЕсли;
	      
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ШаблонPush(Команда)
	
	Если НЕ Элементы.СодержаниеМессенджерHTML.Документ = Неопределено Тогда 
		Объект.СодержаниеМессенджер = СохранитьСодержаниеМессенджер();
	КонецЕсли;	
	
	ПроцедураОбработкиНажатияМеню("ШаблонPush");
	      
КонецПроцедуры

&НаКлиенте
// Процедура - Шаблон SMS
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ШаблонSMS(Команда)
	
	Если НЕ Элементы.СодержаниеМессенджерHTML.Документ = Неопределено Тогда 
		Объект.СодержаниеМессенджер = СохранитьСодержаниеМессенджер();
	КонецЕсли;	
	
	ПроцедураОбработкиНажатияМеню("ШаблонSMS");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Шаблон письма
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ШаблонПисьма(Команда)
	
	Если НЕ Элементы.СодержаниеМессенджерHTML.Документ = Неопределено Тогда 
		Объект.СодержаниеМессенджер = СохранитьСодержаниеМессенджер();
	КонецЕсли;	
	
    ПроцедураОбработкиНажатияМеню("ШаблонПисьма");
	
КонецПроцедуры

&НаКлиенте
// Процедура - Шаблон задачи
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ШаблонЗадачи(Команда)
	
	Если НЕ Элементы.СодержаниеМессенджерHTML.Документ = Неопределено Тогда 
		Объект.СодержаниеМессенджер = СохранитьСодержаниеМессенджер();
	КонецЕсли;	
	
	ПроцедураОбработкиНажатияМеню("ШаблонЗадачи");

КонецПроцедуры

&НаКлиенте
// Процедура - Дерево реквизитов выбор
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбраннаяСтрока		 - 	 - 
//  Поле				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ДеревоРеквизитовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.РазрешитьВыбор = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементРодитель = ТекущиеДанные.ПолучитьРодителя();
	Если ЭлементРодитель <>Неопределено Тогда 
		АктуальныйРаздел = ЭлементРодитель.НаименованиеПараметра
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ФорматСтроки) Тогда 
    	Представление = ТекущиеДанные.ФорматСтроки; 
    Иначе	
	    Представление = ТекущиеДанные.НаименованиеПараметра;
    КонецЕсли;

	ДобавитьЗавершение(Представление);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Скрыть показать дополнительно
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СкрытьПоказатьДополнительно(Команда)
	
	Элементы.ГруппаДополнительно.Видимость = НЕ Элементы.ГруппаДополнительно.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, формирует HTML поле ввода.
//
Процедура СформироватьПолеВвода()
	
	ЭтотОбъект.ПолеВводаСодержанияМессенджера =
	"<!DOCTYPE html>
	|<html>
	|
	|<head>
	|	<meta http-equiv='content-type' content='text/html; charset=UTF-8'>
	|	<meta name='viewport' content='width=device-width, initial-scale=1'>
	|
	|   <script>" + МессенджерСтоматология.ПолучитьСкриптБиблиотеки_331() + "</script>
	|   <script>" + МессенджерСтоматология.ПолучитьСкриптПоляЧата() + "</script>
	|	<style>" + МессенджерСтоматология.ПолучитьСтилиПоляЧата() + "</style>
	|
	|	<script>
	|
	|		$(document).ready(function() {
	|
	|			$('#emojionearea1').emojioneArea({
	|				pickerPosition: 'bottom',
	|				search: false,
	|				placeholder : 'Введите текст шаблона...',
	|				buttonTitle: 'Нажмите TAB, чтобы быстрее открывать эмодзи'
	|			});
	|			setTimeout(
	|				function() {
	|					document.getElementsByClassName('emojionearea-editor')[0].innerHTML = templateValue;
	|					$('.emojionearea-editor').off('blur focus');
	|				}, 300
	|			);
	|           
	|      	});
	|		
	|function encodeURL(text) {
	|	text = encodeURI(text);
	|	text = text.replace(/#/g, '%23');
	|	text = text.replace(/&/g, '%26');
	|	text = text.replace(/\+/g, '%2B');
	|	return text;
	|}	
	|	</script>
	|
	|	<style>
	|		body{overflow-x:hidden;}
	|		.emojionearea .emojionearea-editor{min-width:100%;max-width:100%;min-height:100%;max-height:100%;font-size:16px;}
	|		.emojionearea{border:0;box-shadow:unset;}
	|		.emojionearea.focused{border:0;box-shadow:unset;}
	|		.emojionearea-button{right:7px !important;}
	|		.emojionearea .emojionearea-editor .emojioneemoji{display:inline;max-height:1em;max-width:1em;min-height:1em;min-width:1em;margin:0;}
	|		::-webkit-scrollbar{width:8px;cursor:pointer;}
	|		::-webkit-scrollbar-thumb{background:#9A9A9A;border-radius:5px;}
	|		::-webkit-scrollbar-thumb:hover{background:#757575;}
	|		::-webkit-scrollbar-track{background:#D6D6D6;border-radius:5px;}
	|	</style>
	|</head>
	|
	|<body>
	|	<textarea id='emojionearea1'></textarea>
	|</body>
	|
	|</html>";
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция - Добавить строку в дерево значений
//
// Параметры:
//  РодительСтроки			 - 	 - 
//  НаименованиеПараметра	 - 	 - 
//  ПредставлениеПоля		 - 	 - 
//  РазрешитьВыбор			 - 	 - 
//  ФорматСтроки			 - 	 - 
//  КартинкаСтроки			 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ДобавитьСтрокуВДеревоЗначений(РодительСтроки, НаименованиеПараметра, ПредставлениеПоля, РазрешитьВыбор = Истина, ФорматСтроки = "", КартинкаСтроки = Неопределено)
	
	НоваяСтрока 						= РодительСтроки.Строки.Добавить();
	НоваяСтрока.НаименованиеПараметра 	= НаименованиеПараметра;
	НоваяСтрока.Представление 			= ПредставлениеПоля;	
	НоваяСтрока.РазрешитьВыбор 			= РазрешитьВыбор;
	НоваяСтрока.ФорматСтроки   			= ФорматСтроки;
	Если ЗначениеЗаполнено(КартинкаСтроки) Тогда 
		НоваяСтрока.Картинка   			= КартинкаСтроки;
	КонецЕсли;	
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
// Процедура - Показать режимы кнопок
//
Процедура ПоказатьРежимыКнопок()
	
	Для каждого Группа Из Элементы.КоманднаяПанельКнопок.ПодчиненныеЭлементы Цикл
		Для каждого Кнопка Из Группа.ПодчиненныеЭлементы Цикл
	        Если ТипЗнч(Кнопка) = тип("КнопкаФормы") Тогда
				Команда = Сред(Кнопка.Имя, 8);
				Если Документ.queryCommandSupported(Команда) Тогда
					Попытка
						Кнопка.Пометка = Документ.queryCommandState(Команда);
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Функция - Перевести из10
//
// Параметры:
//  Значение - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПеревестиИз10(Знач Значение = 0)
	
	Значение = Число(Значение);
	Если Значение <= 0 Тогда
		Возврат "00";
	КонецЕсли;
	
	Значение = Цел(Значение);
	Результат = "";
	
	Пока Значение > 0 Цикл
		Результат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%16+1,1) + Результат;
		Значение = Цел(Значение/16);
	КонецЦикла;
	
	Если СтрДлина(Результат) = 1 Тогда
		Результат = "0" + Результат;
	КонецЕсли; 
  
	Возврат Результат;
	
КонецФункции

&НаКлиенте
// Процедура - Включить режим редактирования HTMLКлиент
//
Процедура ВключитьРежимРедактированияHTMLКлиент()
	
	Если Найти(ПисьмоТекстHTML, "<body contentEditable") = 0 И Найти(ПисьмоТекстHTML, "<BODY contentEditable") = 0 Тогда
		
		Если Найти(ПисьмоТекстHTML, "<body") <> 0 Или Найти(ПисьмоТекстHTML, "<BODY") <> 0 Тогда
			ПисьмоТекстHTML = СтрЗаменить(ПисьмоТекстHTML, "<body", "<body contentEditable=true");
			ПисьмоТекстHTML = СтрЗаменить(ПисьмоТекстHTML, "<BODY", "<BODY contentEditable=true");
		Иначе	
			ПисьмоТекстHTML = СтрЗаменить(ПисьмоТекстHTML, "<html>", "<html><body contentEditable=true>");
			ПисьмоТекстHTML = СтрЗаменить(ПисьмоТекстHTML, "</html>", "</body></html>");
			
			ПисьмоТекстHTML = СтрЗаменить(ПисьмоТекстHTML, "<HTML>", "<HTML><BODY contentEditable=true>");
			ПисьмоТекстHTML = СтрЗаменить(ПисьмоТекстHTML, "</HTML>", "</BODY></HTML>");
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обновляет колличество введенных символов.
//
Процедура ОбновитьСтатусВведеныхСимволов()
	
	Текст = Объект.Содержание;
	
	// Удаляем символы переноса строки
	мТекст = Текст;
	Пока Найти(мТекст, Символы.ПС) > 0 Цикл
		мТекст = СтрЗаменить(мТекст, Символы.ПС, "");
	КонецЦикла;
	
	РазмерностьСообщения = ?(СтрДлина(мТекст) > 160, 153, 160); // 1-sms это 160 символов, если больше 160 символов, тогда 1 sms = 153
	КоличествоСМС = 0;

	РусскиеСимволы = "йцукенгшщзхъфывапролджэячсмитьбюё@_$^~`№";
	Для а = 1 По СтрДлина(РусскиеСимволы) Цикл
		Если Найти(мТекст, Сред(РусскиеСимволы, а, 1)) > 0 Тогда
			РазмерностьСообщения = ?(СтрДлина(мТекст) > 70, 67, 70); // 1-sms это 70 символов, если больше 70 символов, тогда 1 sms = 67
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	КоличествоСМС = Цел(СтрДлина(мТекст) / РазмерностьСообщения) + ?(СтрДлина(мТекст) % РазмерностьСообщения > 0, 1, 0);
	
	СтатусВведенныхСимволов =  "" + СтрШаблон(НСтр("ru = 'Введено %1 символов. От %2 sms';en = 'Entered %1 characters. From %2 sms'"), СтрДлина(мТекст), КоличествоСМС);	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Процедура обработки нажатия меню
//
// Параметры:
//  АктивныйЭлементИмя	 - 	 - 
//  НЕАктивныйЭлементИмя - 	 - 
//
Процедура ПроцедураОбработкиНажатияМеню(АктивныйЭлементИмя, ПриОткрытииФормы = Ложь)
	
	Если ПриОткрытииФормы И НЕ Объект.Ссылка.Пустая() Тогда
		
		Если ЗначениеЗаполнено(СокрЛП(Объект.СодержаниеМессенджерHTML)) Тогда
			АктивныйЭлементИмя = "ШаблонМессенджера";			
			
		ИначеЕсли ЗначениеЗаполнено(СокрЛП(Объект.СодержаниеPush)) Тогда 
			АктивныйЭлементИмя = "ШаблонPush";
			
		ИначеЕсли ЗначениеЗаполнено(СокрЛП(Объект.Содержание)) Тогда 
			АктивныйЭлементИмя = "ШаблонSMS";
			
		ИначеЕсли ЗначениеЗаполнено(СокрЛП(Объект.ЗадачаОписание)) Тогда	
	        АктивныйЭлементИмя = "ШаблонЗадачи";
			
		ИначеЕсли ЗначениеЗаполнено(СокрЛП(ПисьмоТекстHTML)) Тогда
			АктивныйЭлементИмя = "ШаблонПисьма";
			
		КонецЕсли;
		
	КонецЕсли;			
	
	Элементы.ГруппаSMS.Видимость			 = (АктивныйЭлементИмя = "ШаблонSMS");
	Элементы.ГруппаPush.Видимость			 = (АктивныйЭлементИмя = "ШаблонPush");
	Элементы.ГруппаПисьмо.Видимость			 = (АктивныйЭлементИмя = "ШаблонПисьма");	
	Элементы.ГруппаЗадача.Видимость			 = (АктивныйЭлементИмя = "ШаблонЗадачи");
	Элементы.ГруппаМессенджер.Видимость		 = (АктивныйЭлементИмя = "ШаблонМессенджера");	
	Элементы.ГруппаПериодОтправки.Видимость	 = Элементы.ГруппаМессенджер.Видимость Или Элементы.ГруппаSMS.Видимость Или Элементы.ГруппаPush.Видимость;
	
	Элементы.СтатусВведенныхСимволов.Видимость = (АктивныйЭлементИмя = "ШаблонSMS");
	
	ЦветФонаАктивнойГруппы		 = Новый Цвет(242,242,242);
	ЦветФонаНеактивнойГруппы	 = Новый Цвет(255,255,255);
	ЦветТекстаАктивнойГруппы	 = Новый Цвет(51,51,51);
	ЦветТекстаНеактивнойГруппы	 = Новый Цвет(51,102,187);
	
	Элементы.ГруппаШаблонSMS.ЦветФона					 = ?((АктивныйЭлементИмя = "ШаблонSMS")			, ЦветФонаАктивнойГруппы, ЦветФонаНеактивнойГруппы);
	Элементы.ГруппаШаблонПисьма.ЦветФона				 = ?((АктивныйЭлементИмя = "ШаблонПисьма")		, ЦветФонаАктивнойГруппы, ЦветФонаНеактивнойГруппы);
	Элементы.ГруппаШаблонЗадача.ЦветФона				 = ?((АктивныйЭлементИмя = "ШаблонЗадачи")		, ЦветФонаАктивнойГруппы, ЦветФонаНеактивнойГруппы);
	Элементы.ГруппаШаблонPushУведомления.ЦветФона		 = ?((АктивныйЭлементИмя = "ШаблонPush")		, ЦветФонаАктивнойГруппы, ЦветФонаНеактивнойГруппы);
	Элементы.ГруппаШаблонСообщенияМессенджера.ЦветФона	 = ?((АктивныйЭлементИмя = "ШаблонМессенджера")	, ЦветФонаАктивнойГруппы, ЦветФонаНеактивнойГруппы);	
	
	Элементы.ШаблонSMS.ЦветТекста			 = ?((АктивныйЭлементИмя = "ШаблонSMS")			, ЦветТекстаАктивнойГруппы, ЦветтекстаНеактивнойГруппы);
	Элементы.ШаблонPush.ЦветТекста			 = ?((АктивныйЭлементИмя = "ШаблонPush")		, ЦветТекстаАктивнойГруппы, ЦветтекстаНеактивнойГруппы);
	Элементы.ШаблонЗадачи.ЦветТекста		 = ?((АктивныйЭлементИмя = "ШаблонЗадачи")		, ЦветТекстаАктивнойГруппы, ЦветтекстаНеактивнойГруппы);
	Элементы.ШаблонПисьма.ЦветТекста		 = ?((АктивныйЭлементИмя = "ШаблонПисьма")		, ЦветТекстаАктивнойГруппы, ЦветтекстаНеактивнойГруппы);
	Элементы.ШаблонМессенджера.ЦветТекста	 = ?((АктивныйЭлементИмя = "ШаблонМессенджера")	, ЦветТекстаАктивнойГруппы, ЦветтекстаНеактивнойГруппы);
		
КонецПроцедуры

&НаКлиенте
// Процедура, вставляет параметр в элемент формы. 
//
Процедура ВставитьПараметр(Результат, ОбъектПоля, ЭлементПоля, УстановитьШрифт = Ложь)
	
	// Инициализация
	Начало = 0; Конец = 0; Вставка = Результат;
	
	// Получаем в переменные Начало и Конец границы выделения
	ЭлементПоля.ПолучитьГраницыВыделения(Начало, Конец);
	
	// Вставляем текст в начало границы выделения
	ВставленныйТекст = ОбъектПоля.Вставить(Начало, Вставка);
	
	// Устанавливаем жирный шрифт
	Если УстановитьШрифт Тогда		
		ВставленныйТекст.Шрифт = Новый Шрифт(,,Истина);
	КонецЕсли;
	
	// После текста "Вставки" вставляем пробел
	ВставленныйТекст = ОбъектПоля.Вставить(ВставленныйТекст.ЗакладкаКонца, " ");
	
	// Возвращаем шрифт установленный для редактора
	ВставленныйТекст.Шрифт = ЭлементПоля.Шрифт;
	
	// Возвращаем фокус на редактор
	ЭтаФорма.ТекущийЭлемент = ЭлементПоля;
	
	// Устанавливаем курсор в конец вставленного текста
	ЭлементПоля.УстановитьГраницыВыделения(ВставленныйТекст.ЗакладкаКонца, ВставленныйТекст.ЗакладкаКонца);		

КонецПроцедуры

&НаСервере
// Процедура, устанавливет текст шаблона
//
Процедура УстановитьТекстШаблона(ТекущийОбъект, СписокФайлов = Неопределено)
	
	УстановитьHTMLДляФорматированногоДокумента(ТекущийОбъект.ТекстHTML, ТекущийОбъект.Ссылка, СписокФайлов);

КонецПроцедуры

&НаСервере
// Процедура, устанавливет HTML для форматированного документа
//
Процедура УстановитьHTMLДляФорматированногоДокумента(ТекстШаблонаПисьмаHTML, СсылкаНаТекущийОбъект, СписокФайлов = Неопределено)
	
	ПараметрШаблона = Новый Структура("Шаблон, УникальныйИдентификатор");
	ПараметрШаблона.Шаблон = СсылкаНаТекущийОбъект;
	ПараметрШаблона.УникальныйИдентификатор = УникальныйИдентификатор;
	Сообщение = КонструкторСообщения();
	Сообщение.Текст = ТекстШаблонаПисьмаHTML;
	ОбработатьHTMLДляФорматированногоДокумента(ПараметрШаблона, Сообщение, Истина, СписокФайлов);
	СтруктураВложений = Новый Структура();
	Если СписокФайлов <> Неопределено Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИдентификаторФормы", УникальныйИдентификатор);
		ДополнительныеПараметры.Вставить("ВызыватьИсключение", Ложь);
		
		Для каждого Вложение Из СписокФайлов Цикл
				Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
					Если ЗначениеЗаполнено(Вложение.Наименование) И Не Вложение.ПометкаУдаления Тогда
						МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
						СведенияОФайле = РаботаСФайлами.ДанныеФайла(Вложение, ДополнительныеПараметры);
						Изображение = Новый Картинка(ПолучитьИзВременногоХранилища(СведенияОФайле.СсылкаНаДвоичныеДанныеФайла));
						СтруктураВложений.Вставить(СведенияОФайле.Наименование, Изображение);
					КонецЕсли;
				КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого ВложениеВHTML Из Сообщение.Вложения Цикл
			Изображение = Новый Картинка(ПолучитьИзВременногоХранилища(ВложениеВHTML.АдресВоВременномХранилище));
			СтруктураВложений.Вставить(ВложениеВHTML.Представление, Изображение);
		КонецЦикла;
	КонецЕсли;
	ПисьмоТекстHTML.УстановитьHTML(Сообщение.Текст , СтруктураВложений);
		
КонецПроцедуры

&НаСервере
// Функция, создает структуру сообщения
//
Функция КонструкторСообщения(ПараметрыШаблона = Неопределено)
	
	Сообщение = Новый Структура();
	Сообщение.Вставить("Тема", "");
	Сообщение.Вставить("Текст", "");
	Сообщение.Вставить("Получатель", Неопределено);
	Сообщение.Вставить("ДополнительныеПараметры",
		?(ПараметрыШаблона <> Неопределено, ПараметрыШаблона, Новый Структура()));
	Сообщение.Вставить("СообщенияПользователю", Новый ФиксированныйМассив(Новый Массив()));
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	Вложения1 = Новый ТаблицаЗначений;
	Вложения1.Колонки.Добавить("Представление", ТипСтрока);
	Вложения1.Колонки.Добавить("АдресВоВременномХранилище", ТипСтрока);
	Вложения1.Колонки.Добавить("Кодировка", ТипСтрока);
	Вложения1.Колонки.Добавить("Идентификатор", ТипСтрока);
	Сообщение.Вставить("Вложения", Вложения1);
	
	Если ПараметрыШаблона <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Сообщение, ПараметрыШаблона);
	КонецЕсли;
	
	Возврат Сообщение;
КонецФункции

&НаСервере
// Обрабатывает текст HTML для помещения в форматированный документ.
//
Процедура ОбработатьHTMLДляФорматированногоДокумента(ПараметрыШаблона, СформированноеСообщение, ПреобразовыватьHTMLДляФорматированногоДокумента, СписокФайлов = Неопределено)

	Если ПустаяСтрока(СформированноеСообщение.Текст) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
		
		Если СписокФайлов = Неопределено Тогда
			СписокФайлов = Новый Массив;
			МодульРаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ПараметрыШаблона.Шаблон, СписокФайлов);
		КонецЕсли;
		
		ДокументHTML = Гипертекст.ПолучитьОбъектДокументHTMLИзТекстаHTML(СформированноеСообщение.Текст);
		Для каждого Картинка Из ДокументHTML.Картинки Цикл
			
			АтрибутИсточникКартинки = Картинка.Атрибуты.ПолучитьИменованныйЭлемент("src");
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ИдентификаторФормы", ПараметрыШаблона.УникальныйИдентификатор);
			ДополнительныеПараметры.Вставить("ВызыватьИсключение", Ложь);
			
			ИзображениеОтсутствуетВПрисоединенныхФайлах = Истина;
			Для Каждого ПрисоединенныйФайл Из СписокФайлов Цикл
				Проверка = Сред(СтрЗаменить(ПрисоединенныйФайл.Наименование, "_", "-"), 2);
				Если СтрЧислоВхождений(АтрибутИсточникКартинки.Значение, Проверка) > 0 Тогда
					ДанныеФайла = РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл.Ссылка, ДополнительныеПараметры);
					ОбработатьКартинкуВТекстеHTMLДляФорматированногоДокумента(Картинка, ДанныеФайла, СформированноеСообщение, 
					АтрибутИсточникКартинки, ПрисоединенныйФайл.Наименование, ПрисоединенныйФайл.Наименование);
					ИзображениеОтсутствуетВПрисоединенныхФайлах = Ложь;
					Прервать;
				ИначеЕсли СтрНачинаетсяС(АтрибутИсточникКартинки.Значение, "cid:" + Проверка) Тогда
					НайденнаяСтрока = СформированноеСообщение.Вложения.Найти(ПрисоединенныйФайл.Наименование, "Представление");
					Если НайденнаяСтрока <> Неопределено Тогда
						СформированноеСообщение.Вложения.Удалить(НайденнаяСтрока);
					КонецЕсли;
					
					ДанныеФайла = РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл.Ссылка, ДополнительныеПараметры);
					ОбработатьКартинкуВТекстеHTMLДляФорматированногоДокумента(Картинка, ДанныеФайла, СформированноеСообщение,
						АтрибутИсточникКартинки, ПрисоединенныйФайл.Наименование, ПрисоединенныйФайл.Наименование);
					ИзображениеОтсутствуетВПрисоединенныхФайлах = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ИзображениеОтсутствуетВПрисоединенныхФайлах Тогда
				ИмяКартинки = Сред(АтрибутИсточникКартинки.Значение, 5);
				НайденнаяСтрока = СформированноеСообщение.Вложения.Найти(ИмяКартинки, "Представление");
				Если НайденнаяСтрока <> Неопределено Тогда
					ДвоичныеДанные = ПолучитьИзВременногоХранилища(НайденнаяСтрока.АдресВоВременномХранилище);
					АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ПараметрыШаблона.УникальныйИдентификатор);
					
					НайденнаяСтрока.Идентификатор = ИмяКартинки;
					НайденнаяСтрока.АдресВоВременномХранилище = АдресВоВременномХранилище;
					НовыйАтрибутКартинки = АтрибутИсточникКартинки.КлонироватьУзел(Ложь);
					НовыйАтрибутКартинки.ТекстовоеСодержимое = ИмяКартинки;
					Картинка.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибутКартинки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ПреобразовыватьHTMLДляФорматированногоДокумента Тогда
			ТекстHTML = Гипертекст.ПолучитьТекстHTMLИзОбъектаДокументHTML(ДокументHTML);
			СформированноеСообщение.Текст = ТекстHTML;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обрабатывает картинку в тексте HTML
//
Процедура ОбработатьКартинкуВТекстеHTMLДляФорматированногоДокумента(Картинка, ПрисоединенныйФайл, СформированноеСообщение, АтрибутИсточникКартинки, Представление, Идентификатор)
	
	НовыйАтрибутКартинки = АтрибутИсточникКартинки.КлонироватьУзел(Ложь);
	НовыйАтрибутКартинки.ТекстовоеСодержимое = ПрисоединенныйФайл.Наименование;
	Картинка.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибутКартинки);
	
	НовоеВложение = СформированноеСообщение.Вложения.Добавить();
	НовоеВложение.Представление = Представление + ".jpg";
	НовоеВложение.АдресВоВременномХранилище = ПрисоединенныйФайл.СсылкаНаДвоичныеДанныеФайла;
	НовоеВложение.Идентификатор = Идентификатор + ".jpg";

КонецПроцедуры

&НаСервере
// Процедура, заменяет имена картинок на идентификаторы
//
Процедура ЗаменитьИменаКартинокНаИдентификаторыПочтовыхВложенийВHTML(ДокументHTML, ТаблицаСоответствий)
	
	Для каждого Картинка Из ДокументHTML.Картинки Цикл
		
		АтрибутИсточникКартинки = Картинка.Атрибуты.ПолучитьИменованныйЭлемент("src");
		НайденнаяСтрока = ТаблицаСоответствий.НайтиПоЗначению(АтрибутИсточникКартинки.ТекстовоеСодержимое);
		Если НайденнаяСтрока <> Неопределено Тогда
			
			НовыйАтрибутКартинки = АтрибутИсточникКартинки.КлонироватьУзел(Ложь);
			НовыйАтрибутКартинки.ТекстовоеСодержимое = Строка("cid:" + НайденнаяСтрока.Представление);
			Картинка.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибутКартинки);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Сохраняет картинки форматированного документа как присоединенные файлы объекта.
//
// Параметры:
//  Ссылка  - ДокументСсылка - ссылка на владельца присоединенных файлов.
//  ТипТекстаПисьма  - Перечисление.СпособыРедактированияЭлектронныхПисем - для определения необходимости выполнения преобразований.
//  ТаблицаСоответствийИменВложенийИдентификаторам  - ТаблицаЗначений - позволяет определить какому вложению
//                                                                      соответствует какая картинка.
//  УникальныйИдентификатор  - УникальныйИдентификатор - уникальный идентификатор формы из которого выполняется сохранение.
//
Процедура СохранитьКартинкиФорматированногоДокументаКакПрисоединенныеФайлы(Ссылка, ТаблицаСоответствийИменВложенийИдентификаторам, УникальныйИдентификатор)
			
	Для каждого Вложение Из ТаблицаСоответствийИменВложенийИдентификаторам Цикл
		
		Вложение.Представление = Вложение.Представление + ".jpg";
		ДвоичныеДанныеКартинки = Вложение.Картинка.ПолучитьДвоичныеДанные();
		АдресКартинкиВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеКартинки, УникальныйИдентификатор);
		ПрисоединенныйФайл = УправлениеЭлектроннойПочтой.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(Ссылка, АдресКартинкиВоВременномХранилище,
		"_" + СтрЗаменить(Вложение.Представление, "-", "_"), ДвоичныеДанныеКартинки.Размер());
		
		Если ПрисоединенныйФайл <> Неопределено Тогда
			ПрисоединенныйФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
			ПрисоединенныйФайлОбъект.ИДФайлаЭлектронногоПисьма = Вложение.Представление;
			ПрисоединенныйФайлОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура, удаляет присоедененный файл
//
Процедура УдалитьПрисоединенныйФайл(ПрисоединенныйФайл)
	ОбъектВложение = ПрисоединенныйФайл.ПолучитьОбъект();
	УстановитьПривилегированныйРежим(Истина);
	ОбъектВложение.Удалить();
КонецПроцедуры

&НаКлиенте
// Функция, возвращает текст.
//
Функция СохранитьСодержаниеМессенджер()
	
	МассивЭлементовHTML = Элементы.СодержаниеМессенджерHTML.Документ.getElementsByClassName("emojionearea-editor"); 
	
	Если МассивЭлементовHTML.length > 0 Тогда
		Объект.СодержаниеМессенджерHTML = МассивЭлементовHTML[0].innerHtml;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Функция - Получить переносы строк
//
// Параметры:
//  Количество	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПереносыСтрок(Количество)
	
	СтрокаПереносы = "";
	Для К=1 По Количество Цикл 
		СтрокаПереносы = СтрокаПереносы + Символы.ПС;
	КонецЦикла;
	
	Возврат СтрокаПереносы;
	
КонецФункции

#КонецОбласти
